[
    {
        "Parameter":"PARNT_GROP",
        "Descripsition":"Dealer Group - This is the dealer group assigned by M&M at the time of starting the dealership. It is unique to the dealership. "
    },
    {
        "Parameter":"LOCTN_CD",
        "Descripsition":"Dealer Code - This is the dealer Code assigned by M&M at the time of Starting the dealership"
    },
    {
        "Parameter":"RO_ID",
        "Descripsition":"Repair Order - RO ID is the unique ID with which Repair Order is created by system"
    },
    {
        "Parameter":"RO_DATE",
        "Descripsition":"is the start of the service (repair order creation time) Repair Order Creation Date & Time"
    },
    {
        "Parameter":"ODMTR_REDNG",
        "Descripsition":"Mileage at which vehicle has reported at workshop for service"
    },
    {
        "Parameter":"RO_STATS",
        "Descripsition":"Status of Repair Order. It is Billed, Closed or Open"
    },
    {
        "Parameter":"REVSD_PROMSD_DELVRY_DATE",
        "Descripsition":"Revised promised Delivery Date & Time. It is the revision which has been made by SA\/RM in the Repair Order from the initial committed Delivery Date & Time. "
    },
    {
        "Parameter":"TECH_EMPLY_CD",
        "Descripsition":"Unique Employee ID given to technician through Mile Portal"
    },
    {
        "Parameter":"PICKUP_LOCTN",
        "Descripsition":"Location from which customer vehicle need to be picked for services"
    },
    {
        "Parameter":"PICKUP_BY",
        "Descripsition":"Employee code of the driver who pick the vehicle for service"
    },
    {
        "Parameter":"PICKUP_TYPE",
        "Descripsition":"Type of service for Pick Up. C- Customer Refused, P - Customer Paid, F - Free of Cost Pick Up & N - Not offered. "
    },
    {
        "Parameter":"DROP_BY",
        "Descripsition":"Employee code of the driver who drop the vehicle for service"
    },
    {
        "Parameter":"DROP_TYPE",
        "Descripsition":"Type of service for Drop. C- Customer Refused, P - Customer Paid, F - Free of Cost Pick Up & N - Not offered. "
    },
    {
        "Parameter":"DROP_LOCTN",
        "Descripsition":"Location to which customer vehicle need to be dropped after services"
    },
    {
        "Parameter":"DROP_REMRKS",
        "Descripsition":"Additional remarks put in by the workshop team for Drop Vehicles"
    },
    {
        "Parameter":"INTL_QUTN_LABR_AMNT",
        "Descripsition":"First Labour Repair Estimate which is created at the time of Job Card opening. This is the first attempt made to give a repair cost estimate for labour, submitted to customer"
    },
    {
        "Parameter":"INTL_QUTN_PART_AMNT",
        "Descripsition":"First Part Repair Estimate which is created at the time of Job Card opening. This is the first attempt made to give a repair cost estimate for Part, submitted to customer"
    },
    {
        "Parameter":"INTL_QUTN_TOTL_AMNT",
        "Descripsition":"First Part and Labour Repair Estimate which is created at the time of Job Card opening. This is the first attempt made to give a repair cost estimate for Part and Labour, submitted to customer"
    },
    {
        "Parameter":"REVSD_QUTN_LABR_AMNT",
        "Descripsition":"Revised Labour Repair Estimate which is created at the time of Job Card opening. This is the last revised repair cost estimate for labour, submitted to customer"
    },
    {
        "Parameter":"REVSD_QUTN_PART_AMNT",
        "Descripsition":"Revised part Repair Estimate which is created at the time of Job Card opening. This is the last revised repair cost estimate for part, submitted to customer"
    },
    {
        "Parameter":"REVSD_QUTN_TOTL_AMNT",
        "Descripsition":"Revised part and labour Repair Estimate which is created at the time of Job Card opening. This is the last revised repair cost estimate for part and labour, submitted to customer"
    },
    {
        "Parameter":"PRE_INV_TOTL_AMNT_WOT",
        "Descripsition":"This is the pre-invoice which is generated by workshop team without tax and shared with customer for approval. This includes both part & labour. Once customer approve this, then Tax Invoice is generated. "
    },
    {
        "Parameter":"PRE_INV_LABR_AMNT_WOT",
        "Descripsition":"This is the pre-invoice which is generated by workshop team without tax for labour Amount and shared with customer for approval. Once customer approve this, then Tax Invoice is generated. "
    },
    {
        "Parameter":"PRE_INV_PART_AMNT_WOT",
        "Descripsition":"This is the pre-invoice which is generated by workshop team without tax for part Amount and shared with customer for approval. Once customer approve this, then Tax Invoice is generated. "
    },
    {
        "Parameter":"INTL_QUTN_TOTL_AMNT_OLD",
        "Descripsition":null
    },
    {
        "Parameter":"DELY_RESN_CD",
        "Descripsition":"Unique Delay Reason Code which is given by SA for Delay in Delivery of the vehicle. "
    },
    {
        "Parameter":"CLOSD_DATE",
        "Descripsition":"is the end of service (vehicle delivered/repair order closed)"
    },
    {
        "Parameter":"PROMSD_DELVRY_DATE",
        "Descripsition":"is just the expected delivery, not actual delivery.Date & Time on which Service Advisor has promised to deliver the vehicle to the customer"
    },
    {
        "Parameter":"SA_EMPLY_CD",
        "Descripsition":"Unique Employee ID given to Service Advisor through Mile Portal who opens the Repair Order in Service Genie and DMS"
    },
    {
        "Parameter":"REG_NUMBR",
        "Descripsition":"Registration Number of the vehicle"
    },
    {
        "Parameter":"VIN",
        "Descripsition":"Vehicle Indentification Number which is unique for all vehicle"
    },
    {
        "Parameter":"SERVC_TYPE",
        "Descripsition":"Serivce Type is the reason for which vehicle has reported at workshop and selected by Service Advisor at the time of Repair Order Opening. RR - Running Repair, PDS - Paid Service, 1,2,3 - 1st 2nd 3rd Free Service, RCL - Recall\/Service Action"
    },
    {
        "Parameter":"DISCNT_AUTHRSD_BY",
        "Descripsition":"Unique Workshop Employee ID given through Mile Portal who has given the discount"
    },
    {
        "Parameter":"PART_DISCNT_PERCNTG",
        "Descripsition":"How much percentage discount has been given on Parts"
    },
    {
        "Parameter":"LABR_DISCNT_PERCNTG",
        "Descripsition":"How much percentage discount has been given on Labour"
    },
    {
        "Parameter":"REPT_RO_ID",
        "Descripsition":"If vehicle visit for same service need\/concern within 1 Month & Less than 1000 kms of the last recorded Kms, then it is considered as Repeat Repair. \nThis field is the Repair Order ID for the same vehicle for the previous visit.  \nThis is the repair order number for which vehicle reported previously for one or more jobs that have been repeated for the current visit and recorded also in the previous visit. "
    },
    {
        "Parameter":"REPT_REMRKS",
        "Descripsition":"Repeat Repair Remarks which is added by workshop team. Comments and understanding of workshop team for the reason why the vehicle had to report again for a repeat job. "
    },
    {
        "Parameter":"CUSTMR_ID",
        "Descripsition":"It is the unique id which has been created by M&M System for each customer"
    },
    {
        "Parameter":"REVST_IND",
        "Descripsition":"If vehicle visit for same service need\/concern within 1 Month & Less than 1000 kms of the last recorded Kms, then it is considered as Repeat Repair. \nWhether the vehicle has revisited again or not. 1- It is a revisit and 0- It is not a revisit which is system generated one. "
    },
    {
        "Parameter":"RECL_CAMPGN_IND",
        "Descripsition":"Whether there is recall or service action is their in the vehicle or not. Indicates whether the specific vehicle and repair order has any service action or sevice recall due. Y indicates - a service action applicable in the service visit and N- indicates no service action pending for the vehicle which has reported for service at workshop. "
    },
    {
        "Parameter":"PICKUP_REMRKS",
        "Descripsition":"Remarks which is given by workshop team for the vehicle which has avail pick up service for repair of the vehicle"
    },
    {
        "Parameter":"EXPRS_SERVC_IND",
        "Descripsition":"This is the indicator whether the vehicle which has reported at workshop for servicen has undergone express service or not. This also indicates the vehicle being attended in express service bay. Y - Vehicle attended in Express Service Bay and N - Vehicle not attended in Express Service Bay. "
    },
    {
        "Parameter":"DIGNSTC_ROAD_TEST_BY",
        "Descripsition":"This is the  FQC - Floor Quality Controller Employee ID who has done the road test in the vehicle for diagnosing the demanded repair by customer and also to identify additional job if any. "
    },
    {
        "Parameter":"MODL_GROP_CD",
        "Descripsition":"Identification of Models Code as defined by Mahindra"
    },
    {
        "Parameter":"FAMLY_CD",
        "Descripsition":"Identification of Model Family as defined by Mahindra. This is unique for each model group and variant"
    },
    {
        "Parameter":"Pre Invoice CRETD_DATE",
        "Descripsition":"The date & time on which Pre-Invoice has been created by workshop team for Repair Order and sent for customer approval. Once Customer approves, Tax Invoice can be generated for the repair order. "
    },
    {
        "Parameter":"CRETD_BY",
        "Descripsition":"The Employee ID who has created Pre-Invoice for Repair Order and sent for customer approval. Once Customer approves, Tax Invoice can be generated for the repair order. "
    },
    {
        "Parameter":"MODFD_DATE",
        "Descripsition":"The date & Time on which Pre-Invoice gets modified "
    },
    {
        "Parameter":"MODFD_BY",
        "Descripsition":"The Employee ID who has modified the pre-invoice of the Repair Order"
    },
    {
        "Parameter":"BILL_DATE",
        "Descripsition":"The date & time on which workshop team has done the billing of Repair Order"
    },
    {
        "Parameter":"ESTMT_VARNC_RESN_CD",
        "Descripsition":"The unique code which Service Advisor selects as the reason for Non-adherence of Estimate given to the customer. "
    },
    {
        "Parameter":"SUPRVSR_CD",
        "Descripsition":"Unique Employee code given to workshop supervisor\/master job controller from mile portal, who allocated to this repair order. "
    },
    {
        "Parameter":"ELCTRCN_CD",
        "Descripsition":"Unique Employee code given to workshop electrician from mile portal, who allocated to this repair order. "
    },
    {
        "Parameter":"TECH_SPECLST_CD",
        "Descripsition":"Unique Employee code given to workshop technician (e-Tek) from mile portal, who allocated to this repair order. "
    },
    {
        "Parameter":"SAME_DAY_DELY_RESN_CD",
        "Descripsition":"The unique code which Service Advisor selects as the reason for Non-adherence of Same Day Delivery of the vehicle. "
    },
    {
        "Parameter":"RO_RE_OPN_DATE",
        "Descripsition":"The date & time on which Repair Order gets reopen after closing in DMS. "
    },
    {
        "Parameter":"LOST_CUS_FLAG",
        "Descripsition":"The customer who has not reported for last 1 year to any of the mahindra authorized service network is considered as lost customer. This data indicated whether the customer is lost or not. Y- Lost Customer who reported in the workshop N - Not a lost customer who has reported to workshop. "
    },
    {
        "Parameter":"REPEAT_JOB_STATS",
        "Descripsition":"The indicator for attending and resolving the repeat repair in the vehicle as mentioned in the repair order. C - Indicates attended and closed. "
    },
    {
        "Parameter":"REPT_PARNT_GROP",
        "Descripsition":"The Dealer parent Group in which vehicle was previously attended for same repairs for which it has reported again in the current visit at the workshop. "
    },
    {
        "Parameter":"REPT_LOCTN_CD",
        "Descripsition":"The Dealer Location Code in which vehicle was previously attended for same repairs for which it has reported again in the current visit at the workshop. "
    },
    {
        "Parameter":"LAST_UPDT_DATE",
        "Descripsition":"The date & time when the last edit has happened in the job card from any of the mahindra system. Service genie or DMS. "
    },
    {
        "Parameter":"PROMSD_DELVRY_DATE_OLD",
        "Descripsition":null
    },
    {
        "Parameter":"ENGN_NUMBR",
        "Descripsition":"Unique ID of the engine assembly given by Mahindra at the time of manufacturing the vehicle. "
    },
    {
        "Parameter":"RSA_IND",
        "Descripsition":"Indicated whether the vehicle has valid Road Side Assistance or not. Y - Indicates valid RSA applicable and N - Indicated not valid RSA"
    },
    {
        "Parameter":"SHILD_IND",
        "Descripsition":"Indicated whether the vehicle has valid Shield\/extended warranty (EW) or not. Y - Indicates valid Shield\/extended warranty(EW)  applicable and N - Indicated not valid Shield\/extended warranty (EW)"
    },
    {
        "Parameter":"SHLD_SCHEM_CD",
        "Descripsition":"This indicates the type of shield\/extended warranty (EW) applicable on the vehicle. "
    },
    {
        "Parameter":"SHLD_EXPRY_DATE",
        "Descripsition":"The date on which Shield\/extended warranty (EW) will expire. "
    },
    {
        "Parameter":"RSA_SCHEM_CD",
        "Descripsition":"This indicates the type of RSA applicable on the vehicle. "
    },
    {
        "Parameter":"RSA_EXPRY_DATE",
        "Descripsition":"The date on which RSA will expire. "
    },
    {
        "Parameter":"JOB_CATGRY",
        "Descripsition":"This indicates the type of job required in the vehicle. MJ - Major job, MN - Minor Job, AGG - Aggregates job & NC - No complaint"
    },
    {
        "Parameter":"BAY_TYPE",
        "Descripsition":"Indicates the type of bay in which the vehicle needs to be attended. "
    },
    {
        "Parameter":"BAY_APPL_TO",
        "Descripsition":"Indicates the range of vehicle which can be serviced or repaired in the specific bay. "
    },
    {
        "Parameter":"PICKUP_FROM_DATE",
        "Descripsition":"The date & Time on which the vehicle pick up process got initiated from customer location for Servicing of the vehicle"
    },
    {
        "Parameter":"PICKUP_TO_DATE",
        "Descripsition":"The date & Time on which the vehicle pick up process got completed from customer location to workshop for Servicing of the vehicle"
    },
    {
        "Parameter":"PICKUP_RATE",
        "Descripsition":"The cost which has been charged by workshop team to customer to avail pick up services"
    },
    {
        "Parameter":"DROP_FROM_DATE",
        "Descripsition":"The date & Time on which the vehicle drop process got initiated from workshop location. "
    },
    {
        "Parameter":"DROP_TO_DATE",
        "Descripsition":"The date & Time on which the vehicle drop process got completed at customer location from workshop location"
    },
    {
        "Parameter":"DROP_RATE",
        "Descripsition":"The cost which has been charged by workshop team to customer to avail drop services"
    },
    {
        "Parameter":"EMAIL_IND",
        "Descripsition":"Indicates whether the email id is available in mahindra database or not. "
    },
    {
        "Parameter":"EMAIL_DATE",
        "Descripsition":"Date & time on which email id of the customer has been updated in the system"
    },
    {
        "Parameter":"ICRE_APNT_NUMBR",
        "Descripsition":"The appointment number which has been created by calling executive in mahindra system. "
    },
    {
        "Parameter":"COST_REV_APPRVL_RESN_CD",
        "Descripsition":"Unique code which has been given by Service advisor for the reason of deviation on final cost as compared to intial approved cost by the customer. "
    },
    {
        "Parameter":"TIME_REV_APPRVL_RESN_CD",
        "Descripsition":"Unique code which has been given by Service advisor for the reason of deviation on Time for delivery as compared to intial approved delivery time by the customer. "
    },
    {
        "Parameter":"DELY_RESN_REMRK_OTH",
        "Descripsition":"The additional remarks which service advisor put for reason of delay in delivery of the vehicle as compared to promised delivery date & time or within 2 hrs of job card opening. "
    },
    {
        "Parameter":"ESTMT_VARNC_RESN_REMRK_OTH",
        "Descripsition":"The additional remarks which service advisor put for reason of deviation in cost estimate of the vehicle as compared to promised cost estimate at the time of opening job card or within 2 hrs of job card opening. "
    },
    {
        "Parameter":"SAME_DAY_DELY_RESN_REMRK_OTH",
        "Descripsition":"The additional remarks which service advisor put for not delivering the vehicle on same day. "
    },
    {
        "Parameter":"PENDNCY_RESN_CD",
        "Descripsition":"unique code which is given by the workshop team for vehicle which are put on hold or pending for delivery. "
    },
    {
        "Parameter":"PENDNCY_RESN_REMRK",
        "Descripsition":"comments or remarks which is given by the workshop team for vehicle which are put on hold or pending for delivery. "
    },
    {
        "Parameter":"VEHICLE_BROUGHT_BY",
        "Descripsition":"The person who bring the vehicle to the workshop for servicing. \nCategory of the person.  "
    },
    {
        "Parameter":"BROUGHT_BY_NAME",
        "Descripsition":"The name of the person who has brought the vehicle to the workshop for servicing"
    },
    {
        "Parameter":"SORC_VAL",
        "Descripsition":"The sytem through which repair oder has been validated. TAB - Service Genie "
    },
    {
        "Parameter":"BILL_TYPE",
        "Descripsition":"Indicated the type of bill which has been generated for the repair order. "
    },
    {
        "Parameter":"CRETD_FROM",
        "Descripsition":"The sytem through which repair oder has been created. TAB - Service Genie "
    },
    {
        "Parameter":"CUST_APRVL_STATS",
        "Descripsition":"Indicates the approval source. CA - Customer Approved, SHA - Service Head Approved, PEND - Approval Pending"
    },
    {
        "Parameter":"CUST_APRVD_AMNT",
        "Descripsition":"The amount which has been approved by the customer. "
    },
    {
        "Parameter":"CUST_APRVL_DELAY",
        "Descripsition":"Indicates the codify reason selected by Service Head for deviating for customer approval of the final bill amount. "
    },
    {
        "Parameter":"SHIELD_SCHEME_REG_NUMBR",
        "Descripsition":"Unique Certificate number which has been generated from the mahindra system for Shield\/Extended Warranty (EW)"
    },
    {
        "Parameter":"RO_OPN_LAST_MODFD_BY",
        "Descripsition":"Indicates the system from where the Repair Order was last modified post Repair order opening. SG - Service Genie & DMS - Dealer Management System "
    },
    {
        "Parameter":"RO_OPN_LAST_MODFD_TIME",
        "Descripsition":"Indicates the date & time on which the repair order was last modified post Repair Order Opening. "
    },
    {
        "Parameter":"SV_RO_CLS_MODFD_BY",
        "Descripsition":"Indicates the system from where the Repair Order was last modified post Repair order closing. SG - Service Genie & DMS - Dealer Management System "
    },
    {
        "Parameter":"SV_RO_CLS_MODFD_TIME",
        "Descripsition":"Indicates the date & time on which the repair order was last modified post Repair Order Closing. "
    },
    {
        "Parameter":"DVI_DAMGE_DETCD",
        "Descripsition":null
    },
    {
        "Parameter":"DVI_PRE_LINK",
        "Descripsition":"This the web portal link which can be used by workshop team and customer to check the vehicle images at the time of vehicle visited at workshop for repair. "
    },
    {
        "Parameter":"DVI_POST_LINK",
        "Descripsition":"This the web portal link which can be used by workshop team and customer to check the vehicle images at the time of vehicle delivery from the workshop. "
    },
    {
        "Parameter":"DVI_CLOSE_LINK",
        "Descripsition":"This the latest inspection web portal link which can be used by workshop team and customer to check the vehicle images at the time of vehicle delivery from the workshop. "
    }
]